package ua.com.cbs.classwork;

import java.util.Scanner;

public class C11_Switch {
    // Оператор багатозначного вибору – switch-case (перемикач).

    public static void main(String[] args) {
        // Пропонуємо користувачеві ввести число.
        System.out.println("Введите число 1 или 2: ");

        // Приймаємо введення від користувача.
        Scanner in = new Scanner(System.in);
        String number = in.next();

        // На 19 рядку створюємо конструкцію багатозначного вибору, перемикач - switch,
        // Який як вираз-селектор, передаємо змінну - number.

        switch (number) { // (number) — вираз-селектор.

            // У тілі перемикача switch-case, на 27 та 32 рядках,
            // створюємо два оператори case, з постійними виразами рівними "1" і "2" відповідно.

            // Якщо значення виразу-селектора збігається з одним із значень постійних виразів,
            // виконується тіло оператора case, постійне вираження якого, збіглося з виразом-селектора.

            case "1": {   // "1" — постійний вираз.
                System.out.println("Один");                                       // Гілка 1
                // Вихід із перемикача.
                break;
            }
            case "2": {
                System.out.println("Два");                                        // Гілка 2
                break;
            }

            // На 40 рядку створюємо (необов'язковий) оператор default, тіло якого виконується у разі,
            // якщо значення виразу-селектора не збігається з жодним із значень постійних виразів.

            default: {
                System.out.println("Ви ввели значення, відмінне від 1 і 2.");       // Гілка 3
                break;
            }

            // Якщо в перемикачі відсутній оператор default, то керування передається за межі перемикача switch.
        }
    }
}
