package ua.com.cbs.classwork;

public class C02_Casting {
    public static void main(String[] args) {
        // Перетворення типу (C02_Casting або Type conversion) - це перетворення значення змінної одного типу значення
        // іншого типу.
        // Виділяють явне (explicit) та неявне (implicit) перетворення типів.

        // Неявне перетворення значення типу - byte у тип int. (перетворення меншого типу на більший)

        byte a = 10;    //                                      0000 1010  -  1 байт
        int b = 0;      //  0000 0000   0000 0000   0000 0000   0000 0000  -  4 байта
        b = a;          //  0000 0000   0000 0000   0000 0000   0000 1010  -  4 байта

        System.out.println("b = " + b);

        // Неявне перетворення значення типу - int у тип float. (перетворення цілого типу на речовинний)
        int c = 255;
        float d = 0f;
        d = c;

        System.out.println("d = " + d);


        // Явне перетворення значення типу - int у тип byte.
        // (перетворення більшого типу на менший, призводить до втрати частини результату)

        int e = 128;    //  0000 0000   0000 0000   0000 0000   1000 0000  -  4 байта
        byte f = 0;     //                                      0000 0000  -  1 байт
        f = (byte)e;    //                                      0000 0001  -  1 байт
        // f = e;       //  ПОМИЛКА.
        System.out.println("f = " + f);

        // Явне перетворення значення типу - float у тип int.
        // (перетворення речовинного типу на цілий, призводить до втрати точності результату)

        float g = 10.5f;
        int h = 0;
        h = (int)g;
        // h = g;       // ПОМИЛКА.

        System.out.println("h = " + h);

        //   ----------------------------------  Константи  ----------------------------------------------

        // Можливе неявне перетворення значення константи типу - int у тип byte,
        // при ініціалізації змінної значенням константи,
        // якщо значення константи вбирається у максимально допустимого значення змінної.

        final int i = 127;
        byte j = 0;
        j = i;

        System.out.println("j = " + j);

        // Можливе явне перетворення значення константи типу - float у тип byte,
        // при ініціалізації змінної значенням константи,
        // якщо значення константи не перевищує максимально допустимого значення змінної

        final float k = 255;
        byte l = 0;
        l = (byte)k;

        System.out.println("l = " + l);

        // Можливе явне перетворення значення константи,
        // при ініціалізації змінної значенням константи,
        // якщо значення константи перевищує максимально допустимий діапазон значення змінної,
        // (перетворення більшого типу на менший, призводить до втрати частини результату)

        final int m = 254;  //  0000 0000   0000 0000   0000 0000   1111 1110  -  4 байта
        byte n = 0;         //                                      0000 0000  -  1 байт
        n = (byte)m;        //                                      0000 0001  -  1 байт
        // n = m;           //  ПОМИЛКА.

        System.out.println("n = " + n);

        // Можливе явне перетворення значення речової константи,
        // при ініціалізації цілісної змінної значенням константи,
        // якщо значення константи перевищує максимально допустимий діапазон значення змінної,
        // (Перетворення більшого типу в менший, призводить до втрати частини результату).

        final float o = 128.5f;
        byte p = 0;
        p = (byte)o;
        // p = o;           //  ПОМИЛКА.

        System.out.println("p = " + p);
    }
}
