package ua.com.cbs.classwork;

public class C02_Port {
    // Побітові логічні операції. (&, |)

    // Наприклад:
    // Ми маємо порт вводу/виводу або регістр з певним значенням у ньому.
    // Нам необхідно включити пристрій, керований першим бітом, встановивши перший біт в 1.
    // Після цього нам потрібно вимкнути пристрій, скинувши перший біт в 0.
    //  0 1 1 1   0 0 0 0  -  початкове значення порту вводу/виводу.
    //  7 6 5 4   3 2 1 0  -  нумерація бітів керування пристроями.

    public static void main(String[] args) {
        byte port = 0b1110000;     // 0 1 1 1   0 0 0 0  -  початкове значення порту вводу/виводу.
        byte mask = 0b0000010;     // 0 0 0 0   0 0 1 0  -  маска увімкнення пристрою керованого першим бітом.
        System.out.println("port = " + port); // ситуація з лампочкою у кімнаті

        port = (byte)(port | mask);  // Увімкнути пристрій керування першим бітом.
        System.out.println("port = " + port);

        mask = 0b1111101;          // 0 1 1 1   1 1 0 1  -  Створюємо маску вимкнення пристрою керованого першим бітом.

        port = (byte)(port & mask);  // Вимкнути пристрій керований першим бітом.
        System.out.println("port = " + port);
    }
}
